Repository: thoughtx/Creatx-WP-API
Catalog: languages/wp-meta-seo-*.po
Languages: fr_fr

source: Twitter username (without @)
fr_fr: ID Twitter (sans le @)

source: 2 plugins that are doing almost the same thing detected: disable AIO SEO or Yoast SEO to avoid conflict.
fr_fr: 2 plugins sont présent et font tous les 2 du SEO: merci de désactiver AIO SEO ou Yoast SEO pour éviter les conflits

source: We have found that you’re using All In One SEO plugin, WP Meta SEO can import the meta from this plugin, %s
fr_fr: Vous utilisez le plugin All in one SEO, nous pouvons importer les meta de ce plugin pour vous, %s

source: We have found that you’re using Yoast SEO plugin, WP Meta SEO can import the meta from this plugin, %s
fr_fr: Vous utilisez le plugin Yoast SEO, nous pouvons importer les meta de ce plugin pour vous, %s

source: Results preview
fr_fr: Prévisualisation

source: This is a preview of what your content will looks like in search engine results: title, description and URL
fr_fr: Prévisualisation des résultats de recherche, titre, description et URL

source: Search engine title
fr_fr: Titre

source: This is the title of your content that may be displayed in search engine results (meta title). By default it’s the content title (page title, post title…). 69 characters max allowed.
fr_fr: Ceci est le titre de votre contenu qui pourra être reprit par les moteurs de recherche (meta title). Par défaut il s'agit du titre du contenu. 69 caractères max

source: Search engine description
fr_fr: Description

source: The description of your content that may be displayed in search engine results aka meta description. By default search engine take an excerpt from your content (depending on the search query). 156 characters max allowed.
fr_fr: Ceci est la description de votre contenu qui pourra être reprit par les moteurs de recherche (meta description). Par défaut il s'agit d'un extrait de votre contenu.156 caractères max

source: Facebook Title
fr_fr: Titre facebook

source: Custom title to display when sharing this content on facebook, content title override
fr_fr: Titre customisé lors du partage de ce contenu sur Facebook

source: Facebook Description
fr_fr: Description Facebook

source: Custom description to display when sharing this content on facebook, content description override
fr_fr: Description customisé lors du partage de ce contenu sur Facebook

source: Facebook Image
fr_fr: Image Facebook

source: Custom image to display when sharing this content on facebook, content description override, recommended size is 1200px x 630px
fr_fr: Image customisé lors du partage de ce contenu sur Facebook, taille recommandée 1200px x 630px

source: Twitter Title
fr_fr: Titre Twitter

source: Custom title to display when sharing this content on twitter, content title override
fr_fr: Titre customisé lors du partage de ce contenu sur Twitter

source: Twitter Description
fr_fr: Description Twitter

source: Custom description to display when sharing this content on twitter, content description override
fr_fr: Description customisé lors du partage de ce contenu sur Twitter

source: Twitter Image
fr_fr: Image Twitter

source: Custom image to display when sharing this content on facebook, content description override, recommended min size 440px X 220px
fr_fr: Image customisé lors du partage de ce contenu sur Twitter, taille recommandée 440px x 220px

source: Use Image
fr_fr: Utiliser image

source: Page title word in content heading
fr_fr: Mot du titre dans un titre du contenu

source: Page title word in content
fr_fr: Mot du titre dans le contenu

source: Page url matches with page title
fr_fr: URL de page correspond au titre de page

source: Meta title filled
fr_fr: Meta titres complétés

source: Meta description filled
fr_fr: Meta descriptions complétées

source: Wrong image resize
fr_fr: Mauvaise taille d'image

source: Image have meta title or alt
fr_fr: Les images ont des meta title ou alt

source: SEO Page optimization
fr_fr: Optimisation moteur de recherche

source: Social for search engine
fr_fr: Partage réseaux sociaux

source: Reload analysis
fr_fr: Relancer analyse

source: Filter by date
fr_fr: Filtrer par date

source: All dates
fr_fr: Toutes les dates

source: Name
fr_fr: Nom

source: Optimization Info
fr_fr: Info optimisation

source: Alternative text
fr_fr: texte alternatif

source: Title
fr_fr: Titre

source: Legend
fr_fr: Légende

source: Select All
fr_fr: Tout selectionner

source: Filter
fr_fr: Filtrer

source: We didn't find any image which needed to be updated regarding meta information
fr_fr: Nous n'avons trouvé aucune image qui ont besoin d'être optimisé pour le SEO

source: This image has still not been inserted in any post!
fr_fr: Cette image n'a été ajouté dans aucun de vos contenus

source: We found %s which needed to optimize
fr_fr: Nous avons trouvé %s qui nécessite une optimisation

source: Replace?
fr_fr: Remplacer ?

source: Replace All
fr_fr: Tout remplacer

source: The post doesn't exist, please select another one
fr_fr: Le post n'existe plus, merci d'en sélectionner un autre

source: There is a problem when update image name
fr_fr: Erreur lors du changement de nom d'image

source: Image name changed
fr_fr: Nom de l'image changé

source: Name already exist
fr_fr: Le nom existe déjà

source: File doesn't existed
fr_fr: Le fichier n'existe plus

source: Should not be empty
fr_fr: Ne peut être vide

source: There is a problem during image meta update
fr_fr: Un problème est survenue durant l'update des meta

source: This content has been deleted, please check again!
fr_fr: Ce contenu a été supprimé, merci de revérifier!

source: The post haven't been updated, please check again!
fr_fr: Ce post n'a pas été mis à jour, merci de revérifier

source: This image has been removed from the post, please check again!
fr_fr: Cette image a été supprimée du contenu

source: Content of the post is empty, please check again
fr_fr: Le contenu est vide, merci de revérifier

source: We can't get traffic rank from Alexa for this website
fr_fr: Nous n'avons pas assez d'info (de trafic) Alexa pour avoir le "Traffic Rank"

source: Meta Title
fr_fr: Meta titre

source: (no title)
fr_fr: (pas de titre)

source: Edit this item
fr_fr: Editer cet item

source: Edit
fr_fr: Editer

source: View
fr_fr: Afficher

source: Preview
fr_fr: Prévisualiser

source: This is a preview of what this content might looks like in Google's search results.
fr_fr: Prévisualisation de ce à quoi votre contenu peut ressembler dans les résultats de recherche

source: Snippet Preview %s
fr_fr: Prévisualisation %s

source: Facebook profile URL
fr_fr: Lien URL profil Facebook

source: Twitter Username
fr_fr: Nom d'utilisateur Twitter

source: Meta block edition
fr_fr: Block édition meta

source: Modification was saved
fr_fr: Modifications sauvegardées

source: Meta title was not saved
fr_fr: Meta titre non sauvegardé

source: Meta description was not saved
fr_fr: Meta description non sauvegardé

source: Dashboard
fr_fr: Tableau de bord

source: Content meta
fr_fr: Contenu meta

source: Settings
fr_fr: Paramètres

source: Activate meta block edition in content
fr_fr: Activer l'édition des block de meta dans le contenu

source: This post is not existed or deleted, please select another one
fr_fr: Ce post n'existe plus ou a été supprimé

source: Well done! This image is perfect now.
fr_fr: Bien joué ! Image remise à la bonne taille !

source: Oops! An error occured when updating the post, please try again
fr_fr: Oups! Une erreur est survenue durant la mise à jour du post, merci de réessayer

source: Resize image
fr_fr: Redimensionner image

source: Image sizes are good!
fr_fr: Taille d'image OK!

source: Fix meta
fr_fr: Améliorer meta

source: Edit meta
fr_fr: Editer meta

source: Poor
fr_fr: Mauvaise qualité

source: Good
fr_fr: Bon

source: Bad
fr_fr: Mauvais

source: Homepage meta title
fr_fr: Meta info page d'accueil

source: Homepage meta description
fr_fr: Description page d'accueil

source: Bulk copy
fr_fr: Copy par lot

source: All content
fr_fr: Tout le contenu

source: Selected posts
fr_fr: Sélection de contenu

source: Content title as meta title
fr_fr: Titre contenu > meta titre

source: All Images
fr_fr: Toutes les images

source: Selected images
fr_fr: Sélection d'images

source: Image name as alt text
fr_fr: Nom image > alt texte

source: Image name as image title
fr_fr: Nom image > titre d'image

source: Warning, you're about to replace existing image alt or tile content, are you sire about that?
fr_fr: Vous êtes sur le point de remplacer des attributs de vos images, vous êtes sûr ?

source: Twitter card type
fr_fr: Type Twitter card

source: Summary
fr_fr: Sommaire

source: Summary with large image
fr_fr: Sommaire avec large image

source: Optimized at
fr_fr: Optimisé à

source: Wrong resized images
fr_fr: Image redimentionnées

source: Latest month new or updated content
fr_fr: Contenu ajouté ou mis à jour le mois dernier

source: Image data filled (in content)
fr_fr: Informations images complétées

source: More information about WP Meta SEO
fr_fr: Plus d'info sur le plugin WP Meta SEO

source: Other plugins from JoomUnited
fr_fr: Autres plugin de JoomUnited

source: Check if a word of this content title is also in a title heading (h1, h2...)
fr_fr: Vérifie si un mot du titre de page est aussi présent dans un titre du contenu (h1, h2...)

source: Check if a word of this content title is also in the text
fr_fr: Vérifie si un mot du titre de page est aussi présent dans le contenu texte

source: Does the page title match with the permalink (URL structure)
fr_fr: Vérifie si le titre de page correspond à l'URL (permalien)

source: Is the meta title of this page filled?
fr_fr: Est-ce que les meta titres sont complétés?

source: Is the meta description of this page filled?
fr_fr: Est-ce que les meta description sont complétés?

source: Check for image HTML resizing in content (usually image resized using handles)
fr_fr: Vérifie si des images sont redimensionnées en HTML (habituellement en utilisant les poignées)

source: Check for image Alt text and title
fr_fr: Vérifie si les textes alt and titre d'images sont remplis

source: It's better using a permalink structure that is adding in your URL the category name and content title. This parameter can be changed in Settings > Permalinks WordPress menu. Tag recommended is %category%/%postname%
fr_fr: Il est préférable d'utiliser des URL dont le nom de la catégorie et le titre de page sont en clair. Ce paramètre peut être modifié depuis le menu Paramètres > Permaliens. Le tag recommandé est %category%/%postname%

source: Meta titles are displayed in search engine results as a page title. It's a good thing for SEO to have some custom and attractive ones. Be sure to fill at least the met information on your most popular pages
fr_fr: Les titres Meta sont affichés dans les résultats de recherche comme titre de page. C'est une bonne chose de mettre des titres accrocheurs pour avoir un plus grand nombre de clics.

source: Meta descriptions are displayed in search engine results as a page description. It's a good thing for SEO to have some custom and attractive ones. Be sure to fill at least the meta information on your most popular pages.
fr_fr: Les Meta descroption sont affichés dans les résultats de recherche comme description de page. C'est une bonne chose de mettre des descriptions accrocheuses pour avoir un plus grand nombre de clics.

source: Display image at its natural size, do not use HTML resize. It happens usually when you use handles to resize an image. You have a bulk edition tool to fix that.
fr_fr: Utilisez des images à leur taille naturelle, pas en les redimensionnant en HTML (avec les poignées). Avec WP Meta SEO, vous disposez d'un outil pour corriger cela

source: We recommend to use both alt text and image title. The main advantage is that it helps search engines discover your images and display them in image search results. Plus, these tags improve the accessibility of your site and give more information about your images. Use our bulk image tool to quickly check and fix that.
fr_fr: Nous vous recommandons de compléter les le textes alternatif et les titres d'images. L'avantage c'est que cela permet aux moteur de recherche d'indexer vos images et apporte plus de contenu à vos pages. utilisez l'outil d'édition par lot pour aller plus vite!

source: It is highly recommended to update or add new content on your website quite frequently. At least 3 updated or new content per month would be great :)
fr_fr: Il est fortement recommandé de mettre à jour ou d'ajouter du contenu sur votre site pour être mieux référencé. Au moins 3 mises à jour ou ajout de contenu par mois serait parfait :)

source: Social networks meta
fr_fr: Meta réseaux sociaux

source: Activate social edition
fr_fr: Activer l'édition des meta pour les réseaux sociaux

source: Permalinks settings
fr_fr: Paramètres permaliens

source: HTML image resizing
fr_fr: Image redimensionnées en HTML

source: Image title/alt
fr_fr: Titre text alt des images

source: New or updated content
fr_fr: Nouveau ou mise à jour contenu

source: WP Meta SEO dashboard
fr_fr: Tableau de bord WP Meta SEO

source: Latest WP Meta SEO News
fr_fr: Dernière news WP Meta SEO

source: All Posts
fr_fr: Tous les posts

source: We can't get rank of this site from Alexa.com!
fr_fr: Impossible de déterminer le Traffic Rank Alexa pour ce site

source: Activate meta block edition below content
fr_fr: Activer l'édition des meta info sous les contenu (pages, articles)

source: Well! This image is so good now.
fr_fr: Parfait! image optimisée

source: The default card type to use
fr_fr: Type de Twitter card

source: Be careful you installed 2 extensions doing almost the same thing, please deactivate AIOSEO or Yoast in order to work more clearly!
fr_fr: Attention plusieurs plugins sont susceptibles d'effectuer les même tâches, essayez de désactiver AIO SEO ou Yoast SEO

source: We have found that you’re using All In One Pack Plugin, WP Meta SEO can import the meta from this plugin, %s
fr_fr: Vous utilisez actuellement All In One SEO Plugin, WP Meta SEO put importer les données de ce plugin pour vous, %s

source: Name is existing
fr_fr: Ce nom existe déjà

source: We found 0 image which needed to add or change meta information
fr_fr: Nous n'avons pas trouvé d'images qui nécessite l'ajout ou l'édition des meta

source: The post is not existed, please choose one another!
fr_fr: Ce post n'existe pas, merci d'un sélectionner un autre

source: Image name was changed
fr_fr: Nom d'image changé

source: File is not existed
fr_fr: Ce fichier n'existe plus

source: There is a problem when update image meta!
fr_fr: Erreur lors de la mise à jour des meta

source: The post has been deleted before, please check again!
fr_fr: Ce contenu a été supprimé, merci de recharger la page

source: This is a rendering of what this post might look like in Google's search results.
fr_fr: Prévisualisation des résultats de recherche Google

source: This post is not existed or deleted, please choose one another!
fr_fr: Ce post n'existe plus, merci d'en sélectionner un autre

source: Opps! An error occured when updating the post, please try again
fr_fr: Oups! une erreur est survenue lors de la mise à jour du contenu

source: Upload Image
fr_fr: Envoyer image

source: WP Meta SEO - Page optimization
fr_fr: WP Meta SEO - Page optimisation

source: Meta title was saved
fr_fr: Metz

source: Content Meta
fr_fr: Meta content

source: Meta keywords was saved
fr_fr: Mot clÃ©s enregistrÃ©s

source: Force SEO validation
fr_fr: Forcer validation SEO

source: Allow user to force on page SEO criteria validation by clicking on the icon
fr_fr: Autoriser la validation forcÃ©e des critÃ¨res SEO dans l'analyse des pages

source: Meta keywords
fr_fr: Mot clés

source: Active meta keywords
fr_fr: Activer les mot clés meta

source: Link text field
fr_fr: Champ titre lien

source: Adds back the missing 'title' field in the Insert/Edit URL box
fr_fr: Ajouter un champ titre dans l'outil d'édition de lien

source: Link titles
fr_fr: Titres lien

source: The link title attribute does not have any SEO value for links. BUT links titles can influence click behavior for users, which may indirectly affect your SEO performance
fr_fr: Les titres des liens n'ont pas d'impact direct sur le SEO MAIS cela peut influencer le comportement des utilisateurs en les incitant a cliquer dessus

source: Links title completed
fr_fr: Titre de lien ajouté

source: Saved.
fr_fr: Enregistré

source: Error.
fr_fr: Erreur

source: Link title
fr_fr: Titre liens

source: Link text
fr_fr: Text lien

source: Meta title as page title
fr_fr: Meta titre vers titre page

source: When meta title is filled use it as page title instead of the content title
fr_fr: Lorsque le meta titre est rempli, l'utiliser plutôt que le titre du contenu

source: It’s better using a permalink structure that is adding in your URL the category name and content title. This parameter can be changed in Settings > Permalinks WordPress menu. Tag recommended is %category%/%postname%
fr_fr: Il est conseillé d'utiliser une structure d'URL qui inclus le nom de la catégorie et le titre du contenu. Ce paramètre peut être changé dans Paramètres > Permaliens. Le tag recommandé est %category%/%postname%

source: Meta descriptions are displayed in search engine results as a page description. It’s a good thing for SEO to have some custom and attractive ones. Be sure to fill at least the meta information on your most popular pages.
fr_fr: Les meta descriptions sont affichées dans les résultats de recherche si ils sont jugés pertinents. Il est bon pour avoir un taux de clics élevé d'en rédiger des attractifs. Assurez vous de les compléter au moins pour vos principales pages.

source: Meta titles are displayed in search engine results as a page title. It’s a good thing for SEO to have some custom and attractive ones. Be sure to fill at least the met information on your most popular pages
fr_fr: Les meta titres sont affichées dans les résultats de recherche. Il est bon pour avoir un taux de clics élevé d'en rédiger des attractifs. Assurez vous de les compléter au moins pour vos principales pages.

source: A website with a bunch of 404 errors doesn’t provide a good user experience, which is significantly important in content marketing and SEO. We recommend to use our internal broken link checker and redirect tool to fix all the 404 error you can periodically.
fr_fr: Un site web qui contient beaucoup d'erreur 404 donne une mauvaise expérience d'utilisation, ce qui est très dommageable pour le marketing et le SEO. Nous vous recommandons de corriger le maximum d'erreur en faisant des redirections pertinentes.

source: Index internal broken links
fr_fr: Indexer les liens brisés

source: Type or Link text
fr_fr: Type ou texte du lien

source: Hits number
fr_fr: Nombre de clic

source: Allow search engines robots to index this content, as default your content is indexed
fr_fr: Autoriser les moteurs de recherche à indexer ce contenu

source: Provides show or do not show this page in search results in search results.
fr_fr: Afficher ou pas cette page dans les résultats des moteurs de recherche

source: Re-index content links
fr_fr: Re-indexer liens

source: Apply
fr_fr: Appliquer

source: Follow selected
fr_fr: Follow sélection

source: Nofollow selected
fr_fr: Nofollow sélection

source: Follow all
fr_fr: Follow tous

source: Nofollow all
fr_fr: Nofollow tous

source: Link source
fr_fr: Source lien

source: Internal
fr_fr: Interne

source: External
fr_fr: Externe

source: Post/Page follow
fr_fr: Article/Page follow

source: Post/Page index
fr_fr: Article/Page index

source: Use ImageRecycle image compression plugin to activate this feature
fr_fr: Activation : l'installation du plugin de compression d'image ImageRecycle est nécessaire

source: Images represent around 60% of a web page weight. An image compression reduce the image size by up to 70% while preserving the same visual quality. Small loading time is great for SEO!
fr_fr: Les images représentent en moyenne 60% du poids d'une page web. Une compression sans perte de qualité réduit de manière importante le poids de votre page, parfait pour le référencement !
